Revit 2026 API

# StructuralAssetSubClass Property

---

The sub-class of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SubClass { get; set; }
```
```vb
Public Property SubClass As String
	Get
	Set
```
```cpp
public:
property String^ SubClass {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SubClass : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace